hiblog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "comment", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "body" = ?, "comment" = ?, "slug" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "this is lasttitle"], ["body", "this is lasttitlecontent"], ["comment", "this is lasttitlecomment"], ["slug", "this-is-lasttitle"], ["updated_at", 2016-10-03 08:19:55 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)